# YOLO3Ds

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

anchors: # depth, width, height of the anchor boxes
- [332,152,155, 250,177,177, 283,173,161, 277,160,181, 306,158,172, 268,168,203]  # P3/8
- [332,171,161, 303,178,172, 277,195,171, 337,156,179, 285,181,188, 256,201,194]  # P4/16
- [309,176,199, 335,188,170, 336,175,187, 296,198,205, 331,207,192, 302,232,234]  # P5/32
- [309,176,199, 335,188,170, 336,175,187, 296,198,205, 331,207,192, 302,232,234]  # P5/32


# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

neck:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]], #18  卷积层 通道变为128，尺寸不变,则[128，80，80                  
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #19 上采样，通道数不变，尺寸翻倍,则[256，160，160]
   [[-1, 2], 1, Concat, [1]],  #20 Concat 特征融合，将上一层与第2层连接起来。通道翻倍，尺寸不变[512，160，160]            
   [-1, 3, C3, [128, False]],  #21  C3    不进行short cut  只改变通道数 [128，160，160]

   [-1, 1, Conv, [128, 3, 2]], #22  卷积层 通道变为128，尺寸减半,则[128，80，80]               
   [[-1, 18], 1, Concat, [1]], #23  Concat 特征融合，将上一层与第18层连接起来。通道翻倍，尺寸不变[512，160，160]   
   [-1, 3, C3, [256, False]],  #24   C3    不进行short cut  只改变通道数 [256，160，160] 
   [-1, 1, Conv, [256, 3, 2]],  #25  卷积层 通道变为256，尺寸减半,则[256，40，40]                
   [[-1, 14], 1, Concat, [1]],  #26 Concat 特征融合，将上一层与第14层连接起来。通道翻倍，尺寸不变[512，160，160]  
   
   [-1, 3, C3, [512, False]],  #27 C3 不进行short cut  只改变通道数 [512，40，40]
   [-1, 1, Conv, [512, 3, 2]], #28  卷积层 通道变为512，尺寸减半,则[512，20，20] 
   [[-1, 10], 1, Concat, [1]],  #29  特征融合，将上一层与第10层连接起来。通道翻倍，尺寸不变[1024，20，20]            
   [-1, 3, C3, [1024, False]],  #30 C3 不进行short cut  只改变通道数 [1027，20，20]
 ]

# YOLOv5 v6.0 head
head:
  # [from, number, module, args]
  [
   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]